# Notebook 2 - Pre-Processing Testing Set

In the Notebook-1, we selected KNC Algorithm for building the model. In this Notebook-2, we have pre-processed the testing dataset to help future work.

## Import Dependancies

In [3]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt

In [4]:
df = pd.read_csv('./data/test_kaggle.csv')

In [5]:
df.head()

   Customer_ID outlet_city luxury_sales fresh_sales dry_sales
0        33574  batticaloa       2686.5        3582     12537
1        10089  batticaloa      1717.56     2576.34   9446.58
2        38329  batticaloa       854.04     1242.24   5201.88
3        11376  batticaloa      1638.12     2320.67   9282.68
4        12410  batticaloa      1039.09     1518.67   5435.24

## Data Pre-processing

In [6]:
from spellchecker import SpellChecker

# Initialize the spell checker
spell = SpellChecker()

import re
from word2number import w2n

# Function to check if a value contains words
def contains_words(s):
    if isinstance(s, str):
        return bool(re.search('[a-zA-Z]', s))
    return False

# Find all cells with words and print their locations
for col in ['luxury_sales','fresh_sales','dry_sales']:
    for idx, value in df[col].items():
        if contains_words(value):
            print(f"Cell at row {idx}, column '{col}' contains words: '{value}'")

# Function to correct spelling errors
def correct_spelling(text):
    corrected_words = [spell.correction(word) for word in text.split()]
    return ' '.join(corrected_words)

# Function to convert worded numbers to numerical values
def convert_words_to_numbers(s):
    try:
        return w2n.word_to_num(s)
    except ValueError:
        return s
        
# Columns to be checked and converted
columns_to_convert = ['luxury_sales', 'fresh_sales', 'dry_sales']

# Apply the correction and conversion function to the specified columns
for col in columns_to_convert:
    df[col] = df[col].apply(lambda x: convert_words_to_numbers(correct_spelling(x)) if isinstance(x, str) else x)

# Print specific rows after transformation
specific_rows_after = df.loc[[6, 6299, 13949, 40746]]
print("\nAfter transformation:\n", specific_rows_after)

Cell at row 6, column 'luxury_sales' contains words: 'Seven Hundread and sixty Ruppees'
Cell at row 6299, column 'luxury_sales' contains words: 'Eight Hundread and fifteen ruppes'
Cell at row 13949, column 'fresh_sales' contains words: 'Nine thousand ruppess'
Cell at row 40746, column 'dry_sales' contains words: 'Three Thousand seven hundread ruppees'

After transformation:
        Customer_ID   outlet_city luxury_sales fresh_sales dry_sales
6            10364    batticaloa          760       914.4    3352.8
6299          4059  Anuradhapura          815     1548.69    5705.7
13949        28662        Jaffna      2195.84        9000   1509.64
40746        28664       Wattala       3838.6      3951.5      3700

In [7]:
df['luxury_sales'] = df['luxury_sales'].replace('Thousand tow hundread ', 1200)

In [8]:
df["outlet_city"].value_counts()

outlet_city
Jaffna                    2226
Gampaha                   2198
Katunayake                2157
Negombo                   2129
Kandy                     2101
Colombo                   2092
Dehiwala-Mount Lavinia    1981
Nuwara Eliya              1963
Kaduwela                  1943
Wattala                   1938
Kelaniya                  1934
Homagama                  1930
Peliyagoda                1839
Trincomale                1814
Panadura                  1810
Batticaloa                1671
Anuradhapura              1645
Kalmunai                  1634
Moratuwa                  1563
Madawachiya               1499
kalmunai                   599
Galle                      456
batticaloa                 448
Kotte                      379
MoraTuwa                   340
Trincomalee                258
PeliyagodA                 202
Name: count, dtype: int64

In [9]:
df["outlet_city"].nunique()

27

In [10]:
# Convert values in the "outlet_city" column to lowercase
df["outlet_city"] = df["outlet_city"].str.lower()

In [11]:
df["outlet_city"].nunique()

23

In [12]:
df['outlet_city'] = df['outlet_city'].replace('trincomale', 'trincomalee')

In [13]:
df["outlet_city"].nunique()

22

In [14]:
df["outlet_city"].value_counts()

outlet_city
kalmunai                  2233
jaffna                    2226
gampaha                   2198
katunayake                2157
negombo                   2129
batticaloa                2119
kandy                     2101
colombo                   2092
trincomalee               2072
peliyagoda                2041
dehiwala-mount lavinia    1981
nuwara eliya              1963
kaduwela                  1943
wattala                   1938
kelaniya                  1934
homagama                  1930
moratuwa                  1903
panadura                  1810
anuradhapura              1645
madawachiya               1499
galle                      456
kotte                      379
Name: count, dtype: int64

In [15]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 40749 entries, 0 to 40748
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Customer_ID   40749 non-null  int64
 1   outlet_city   40749 non-null  object
 2   luxury_sales  40749 non-null  object
 3   fresh_sales   40749 non-null  object
 4   dry_sales     40749 non-null  object
dtypes: int64(1), object(4)
memory usage: 1.6+ MB

In [16]:
df['luxury_sales'] = df['luxury_sales'].astype(float)
df['fresh_sales'] = df['fresh_sales'].astype(float)
df['dry_sales'] = df['dry_sales'].astype(float)

In [17]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 40749 entries, 0 to 40748
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Customer_ID   40749 non-null  int64
 1   outlet_city   40749 non-null  object
 2   luxury_sales  40749 non-null  float64
 3   fresh_sales   40749 non-null  float64
 4   dry_sales     40749 non-null  float64
dtypes: float64(3), int64(1), object(1)
memory usage: 1.6+ MB

In [18]:
# Add a total sales column
df['total_sales'] = df['luxury_sales'] + df['fresh_sales'] + df['dry_sales']

In [19]:
df.head()

   Customer_ID outlet_city  luxury_sales  fresh_sales  dry_sales  total_sales
0        33574  batticaloa       2686.50      3582.00   12537.00     18805.50
1        10089  batticaloa       1717.56      2576.34    9446.58     13740.48
2        38329  batticaloa        854.04      1242.24    5201.88      7298.16
3        11376  batticaloa       1638.12      2320.67    9282.68     13241.47
4        12410  batticaloa       1039.09      1518.67    5435.24      7993.00

In [20]:
df["outlet_city"].value_counts()

outlet_city
kalmunai                  2233
jaffna                    2226
gampaha                   2198
katunayake                2157
negombo                   2129
batticaloa                2119
kandy                     2101
colombo                   2092
trincomalee               2072
peliyagoda                2041
dehiwala-mount lavinia    1981
nuwara eliya              1963
kaduwela                  1943
wattala                   1938
kelaniya                  1934
homagama                  1930
moratuwa                  1903
panadura                  1810
anuradhapura              1645
madawachiya               1499
galle                      456
kotte                      379
Name: count, dtype: int64

In [21]:
# Create a mapping from city to province
#common_groups = {'Urban': ['colombo', 'batticaloa', 'galle', 'negombo', 'jaffna', 'katunayake', 'kandy', 'trincomalee', 'gampaha', 'peliyagoda', 'nuwara eliya', 'panadura', 'wattala',  'kalmunai'], 
                 #'Suburban': ['dehiwala-mount lavinia', 'kotte', 'kaduwela', 'homagama', 'moratuwa', 'kelaniya', 'anuradhapura', 'madawachiya']}

#city_to_province = {city: province for province, cities in common_groups.items() for city in cities}

# Replace the 'outlet_city' values with the corresponding province names
#df['Council'] = df['outlet_city'].map(city_to_province)

In [22]:
#df["Council"].value_counts()

In [23]:
df.head()

   Customer_ID outlet_city  luxury_sales  fresh_sales  dry_sales  total_sales
0        33574  batticaloa       2686.50      3582.00   12537.00     18805.50
1        10089  batticaloa       1717.56      2576.34    9446.58     13740.48
2        38329  batticaloa        854.04      1242.24    5201.88      7298.16
3        11376  batticaloa       1638.12      2320.67    9282.68     13241.47
4        12410  batticaloa       1039.09      1518.67    5435.24      7993.00

In [24]:
round((df.isnull().sum()/df.shape[0])*100,2) #checking null value %

Customer_ID     0.0
outlet_city     0.0
luxury_sales    0.0
fresh_sales     0.0
dry_sales       0.0
total_sales     0.0
dtype: float64

In [25]:
#df["Council"].nunique()

In [26]:
df.duplicated().sum()

0

In [27]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 40749 entries, 0 to 40748
Data columns (total 6 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Customer_ID   40749 non-null  int64
 1   outlet_city   40749 non-null  object
 2   luxury_sales  40749 non-null  float64
 3   fresh_sales   40749 non-null  float64
 4   dry_sales     40749 non-null  float64
 5   total_sales   40749 non-null  float64
dtypes: float64(4), int64(1), object(1)
memory usage: 1.9+ MB

In [28]:
df.head()

   Customer_ID outlet_city  luxury_sales  fresh_sales  dry_sales  total_sales
0        33574  batticaloa       2686.50      3582.00   12537.00     18805.50
1        10089  batticaloa       1717.56      2576.34    9446.58     13740.48
2        38329  batticaloa        854.04      1242.24    5201.88      7298.16
3        11376  batticaloa       1638.12      2320.67    9282.68     13241.47
4        12410  batticaloa       1039.09      1518.67    5435.24      7993.00

In [29]:
from sklearn.preprocessing import StandardScaler

# Define the columns you want to scale
columns_to_scale = ['luxury_sales', 'fresh_sales', 'dry_sales','total_sales']

# Initialize the StandardScaler
scaler = StandardScaler()

# Fit and transform the scaler on the selected columns
df[columns_to_scale] = scaler.fit_transform(df[columns_to_scale])

In [30]:
df.head()

   Customer_ID outlet_city  luxury_sales  fresh_sales  dry_sales  total_sales
0        33574  batticaloa      0.756569    -0.257052   2.300097     2.020720
1        10089  batticaloa     -0.208718    -0.557303   1.394065     0.699045
2        38329  batticaloa     -1.068982    -0.955614   0.149628    -0.982024
3        11376  batticaloa     -0.287859    -0.633636   1.346014     0.568833
4        12410  batticaloa     -0.884630    -0.873082   0.218043    -0.800712

In [31]:
# Define the mapping dictionary
#mapping = {'Urban': 0, 'Suburban': 1}
# Encode the 'Season' column
#df['Council'] = df['Council'].map(mapping)

In [32]:
df.shape

(40749, 6)

In [33]:
df.head()

   Customer_ID outlet_city  luxury_sales  fresh_sales  dry_sales  total_sales
0        33574  batticaloa      0.756569    -0.257052   2.300097     2.020720
1        10089  batticaloa     -0.208718    -0.557303   1.394065     0.699045
2        38329  batticaloa     -1.068982    -0.955614   0.149628    -0.982024
3        11376  batticaloa     -0.287859    -0.633636   1.346014     0.568833
4        12410  batticaloa     -0.884630    -0.873082   0.218043    -0.800712

In [34]:
#df.drop(columns=['outlet_city'], inplace=True)

In [35]:
df.head()

   Customer_ID outlet_city  luxury_sales  fresh_sales  dry_sales  total_sales
0        33574  batticaloa      0.756569    -0.257052   2.300097     2.020720
1        10089  batticaloa     -0.208718    -0.557303   1.394065     0.699045
2        38329  batticaloa     -1.068982    -0.955614   0.149628    -0.982024
3        11376  batticaloa     -0.287859    -0.633636   1.346014     0.568833
4        12410  batticaloa     -0.884630    -0.873082   0.218043    -0.800712

In [36]:
df = pd.get_dummies(df, columns=['outlet_city'])

In [37]:
df.shape

(40749, 27)

In [38]:
df.head()

,Customer_ID,luxury_sales,fresh_sales,dry_sales,total_sales,outlet_city_anuradhapura,outlet_city_batticaloa,outlet_city_colombo,outlet_city_dehiwala-mount lavinia,outlet_city_galle,...,outlet_city_kelaniya,outlet_city_kotte,outlet_city_madawachiya,outlet_city_moratuwa,outlet_city_negombo,outlet_city_nuwara eliya,outlet_city_panadura,outlet_city_peliyagoda,outlet_city_trincomalee,outlet_city_wattala
0,33574,0.756569,-0.257052,2.300097,2.020720,False,True,False,False,False,...,False,False,False,False,False,False,False,False,False,False
1,10089,-0.208718,-0.557303,1.394065,0.699045,False,True,False,False,False,...,False,False,False,False,False,False,False,False,False,False
2,38329,-1.068982,-0.955614,0.149628,-0.982024,False,True,False,False,False,...,False,False,False,False,False,False,False,False,False,False
3,11376,-0.287859,-0.633636,1.346014,0.568833,False,True,False,False,False,...,False,False,False,False,False,False,False,False,False,False
4,12410,-0.884630,-0.873082,0.218043,-0.800712,False,True,False,False,False,...,False,False,False,False,False,False,False,False,False,False

In [39]:
df.to_csv('./data/test_processed.csv',index=False)

#### Pre-Processed Testing Dataset is Saved.